CSI API ETABS v1
cDetailing.GetSimilarSlabs Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSimilarSlabs(
	string SlabName,
	ref int NumberSimilarSlabs,
	ref string[] Names
)
Function GetSimilarSlabs (
	SlabName As String,
	ByRef NumberSimilarSlabs As Integer,
	ByRef Names As String()
) As Integer
Dim instance As cDetailing
Dim SlabName As String
Dim NumberSimilarSlabs As Integer
Dim Names As String()
Dim returnValue As Integer
returnValue = instance.GetSimilarSlabs(SlabName,
	NumberSimilarSlabs, Names)
int GetSimilarSlabs(
	String^ SlabName,
	int% NumberSimilarSlabs,
	array<String^>^% Names
)
abstract GetSimilarSlabs :
        SlabName : string *
        NumberSimilarSlabs : int byref *
        Names : string[] byref -> int
Parameters
SlabName
Type: System.String
NumberSimilarSlabs
Type: System.Int32
Names
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace